#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<stdlib.h>
#include<Windows.h>
#include<string.h>
//void text(void)	//严格点可以加个void
//{
//	printf("hehe\n");
//}
//int main()
//{
//	text(100);	//C语言中函数为空可以传也可以不传参数
//	return 0;
//}

//整型分为有符号数和无符号数，无符号数原反补相同，有符号数又分正数和负数，而正数原反补相同

//现在vs存储是用小端存储

//int  main()
//{
//	int a = 8;
//	//00000000000000000000000000001000 -原码
//	//00000000000000000000000000001000 -反码
//	//00000000000000000000000000001000 -补码
//	int b = -10;
//	//10000000000000000000000000001010 -原码
//	//11111111111111111111111111110101 -反码-原码除了符号位其他按位取反
//	//11111111111111111111111111110110 -补码-反码加1
//	return 0;
//}

//设计一个小程序来判断字节序

//int main()
//{
//	int n = 1;
//	//转化为16进制:0x 00 00 00 01，如果小端则内存开头为01，大端则为00
//	char* p = (char*)&n;
//	if (*p == 0)
//	{
//		printf("大端\n");
//	}
//	else
//	{
//		printf("小端\n");
//	}
//	return 0;
//}

//最好能封装一个函数

//int check_sys(void)
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 0)
//		return 0;
//	else
//		return 1;
//}
//int check_syss(void)	//更好
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	if (check_syss())
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//一些列阴间题目输出什么？

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	//11111111 -c的补码
//	//00000000000000000000000011111111 -c整型提升后的补码
//	printf("a=%d b=%d c=%d", a, b, c);	//这里要打印整型发生了整型提升
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000	-整型提升先求原码
//	//11111111111111111111111101111111	-反码
//	//11111111111111111111111110000000	-补码
//	//10000000	-截断后八位再放入char中
//	//11111111111111111111111110000000	-整型提升，因为是char类型第一位是符号位补1
//	printf("%u\n", a);
//	//%d	-打印十进制有符号数字
//	//%u	-打印十进制无符号数字
//	//无符号数原反补相同
//	return 0;
//}

//int main()
//{
//	char a = 128;	//要先整型提升再截断8位放进去，100000000
//	printf("%u\n", a);	//和上面结果一样
//	return 0;
//}

//int main()
//{
//	int j = -20;
//	//10000000000000000000000000010100
//	//01111111111111111111111111101011
//	//01111111111111111111111111101100
//	unsigned int i = 10;
//	//00000000000000000000000000001010
//	printf("%d\n", j + i);	//这里主要是%d是有符号，如果%u的话打印原码要变一个很大的数
//	//01111111111111111111111111110110	-补码
//	//01111111111111111111111111110101	-反码
//	//10000000000000000000000000001010	-原码	-10
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//		if (i==1)
//		{
//			system("pause");
//		}
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%lld\n", strlen(a));
//	//-128
//	//10000000	-补码
//	//-129
//	//10000000000000000000000010000001	-原码
//	//11111111111111111111111101111110	-反码
//	//11111111111111111111111101111111	-补码
//	//进行截断0111111就变成127了，这样一直-1，再减127个就到0
//	return 0;
//}

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)	//char类型0—255
//	{
//		printf("hello world\n");
//	}
//	//256
//	//00000000 00000000 00000001 00000000	-原码
//	//01111111 11111111 11111110 11111111	-反码
//	//01111111 11111111 11111111 00000000	-补码
//	//进行截断00000000又重0开始
//	return 0;
//}

//浮点数的学习

int main()
{
	double a = 1E10;
	printf("%lf", a);
	return 0;
}