#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

int main()
{
	int n = 9;
	//00000000000000000000000000001001	-补码
	//0 00000000 00000000000000000001001，E处全0，则E的真实值位1-127=-126，并且M处不补1
	float* pfloat = (float*)&n;
	printf("n=%d\n", n);
	printf("*pfloat=%f\n", *pfloat);	

	*pfloat = 9.0;
	printf("n=%d\n", n);
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000000
	//1091567616
	printf("*pfloat=%f\n", *pfloat);
	return 0;
}

//int main()
//{
//	float f = 5.5;
//	//101.1
//	//(-1) * 0 1.011 * 2^2
//	//S=0
//	//M=011
//	//E=2+127=129
//	//0 10000001 01100000000000000000000
//	//01000000101100000000000000000000
//	//0x40B0 0000
//	return 0;
//}